{
  "backend/main.mo": "Main backend actor implementing vocabulary management, user progress tracking, rewards system, and user profiles with role-based access control (admin/user permissions) using authorization mixins.",
  "backend/migration.mo": "Migration module with placeholder types and a pass-through run function that returns old state unchanged, prepared for future state transformations.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: Internet Identity authentication, guest mode access, and frontend-backend progress tracking integration with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 15 frontend files describing authentication removal for guest access, progress/rewards components, quiz game, vocabulary cards, and styling configurations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for consistent design tokens.",
  "frontend/index.html": "HTML entry point for the KidLingo application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component using TanStack Router with routes for dashboard, vocabulary, and quiz; shows profile setup modal for authenticated users without profiles and supports guest access.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, navigation, and footer; displays Sign Up/Login button for guests and Logout for authenticated users with home navigation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time authenticated users to set up their profile by entering name and selecting preferred language to learn.",
  "frontend/src/components/ProgressDisplay.tsx": "Displays user progress (completed lessons and total score) with authentication-gated access, prompting unauthenticated users to sign up via Internet Identity.",
  "frontend/src/components/QuizQuestion.tsx": "Renders a quiz question with an image and multiple-choice options, providing immediate visual feedback on answer correctness with animations.",
  "frontend/src/components/QuizResult.tsx": "Shows quiz completion results with score, star rating, and navigation buttons to return home or retry the quiz.",
  "frontend/src/components/RewardsBadge.tsx": "Displays earned rewards (stars and gold stars) for authenticated users, prompting unauthenticated users to sign up to earn badges.",
  "frontend/src/components/VocabularyCategoryCard.tsx": "Card component for a vocabulary category with navigation buttons to learn vocabulary or take a quiz for that category.",
  "frontend/src/components/WordCard.tsx": "Flippable card component displaying a word with an image on the front and its translation on the back.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance, handling authentication state and initializing access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, vocabulary, progress, rewards, and quiz interactions with the backend actor. Includes queries for fetching data and mutations for saving profiles, completing lessons, and checking quiz answers.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom kid-friendly color palette (warm oranges, purples, greens) for light and dark modes. Includes custom animations (bounce-in, wiggle) and 3D flip card utilities for interactive UI elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying vocabulary categories, user progress, rewards, and a hero banner. Shows guest mode banner with login prompt for unauthenticated users and progress/rewards for authenticated users.",
  "frontend/src/pages/QuizGame.tsx": "Quiz game page that generates multiple-choice questions from vocabulary words, tracks score, and saves progress for authenticated users. Supports guest mode with local answer checking but no progress saving.",
  "frontend/src/pages/VocabularyCategory.tsx": "Displays a grid of word cards for a specific vocabulary category with back navigation to dashboard. Shows loading state and empty state when no words are available.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing. Includes sessionStorage persistence and cleanup functions for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space, extended typography, container queries, animations, and custom design tokens for a kid-friendly UI with playful styling.",
  "project_state.json": "Project state tracking document for an educational language learning app for kids, documenting existing features (vocabulary modules, quizzes, rewards, Internet Identity auth, guest mode), known deployment and authentication issues, and architectural notes about backend integration needs."
}